# Join Statements

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
c = conn.cursor()

## Display the names of all the employees in Boston.

In [3]:
#Your code here
c.execute('''SELECT * FROM offices
                      JOIN employees
                      USING(officeCode);
                      ''')
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df.loc[df['city']=='Boston',['lastName','firstName']]

    lastName firstName
6   Firrelli     Julie
7  Patterson     Steve

## Do any offices have no employees?

0 offices have no employees.

In [4]:
#Your code here
df.loc[df['employeeNumber']=='']

Empty DataFrame
Columns: [officeCode, city, phone, addressLine1, addressLine2, state, country, postalCode, territory, employeeNumber, lastName, firstName, extension, email, reportsTo, jobTitle]
Index: []

## Write 3 Questions of your own and answer them

Which employees report to no one?

Who works at office code 3?

Who works outside of the USA?

In [5]:
# Your code here
df.loc[df['reportsTo']=='',['lastName','firstName']]

  lastName firstName
0   Murphy     Diane

In [6]:
# Your code here
df.loc[df['officeCode']=='3']

,officeCode,city,phone,addressLine1,addressLine2,state,country,postalCode,territory,employeeNumber,lastName,firstName,extension,email,reportsTo,jobTitle
8,3,NYC,+1 212 555 3000,523 East 53rd Street,apt. 5A,NY,USA,10022,NA,1286,Tseng,Foon Yue,x2248,ftseng@classicmodelcars.com,1143,Sales Rep
9,3,NYC,+1 212 555 3000,523 East 53rd Street,apt. 5A,NY,USA,10022,NA,1323,Vanauf,George,x4102,gvanauf@classicmodelcars.com,1143,Sales Rep

In [7]:
# Your code here
df.loc[df['country']!='USA',['lastName','firstName','country']]

     lastName firstName    country
10     Bondur    Gerard     France
11     Bondur      Loui     France
12  Hernandez    Gerard     France
13   Castillo    Pamela     France
14     Gerard    Martin     France
15      Nishi      Mami      Japan
16       Kato   Yoshimi      Japan
17  Patterson   William  Australia
18     Fixter      Andy  Australia
19      Marsh     Peter  Australia
20       King       Tom  Australia
21       Bott     Larry         UK
22      Jones     Barry         UK

## Level Up: Display the names of each product each employee has sold.

In [10]:
# Your code here
c.execute('''SELECT * FROM employees e
                      JOIN customers c
                      ON c.salesRepEmployeeNumber = e.employeeNumber
                      JOIN orders
                      USING(customerNumber)
                      JOIN orderdetails
                      USING(orderNumber)
                      JOIN products
                      USING(productCode);
                      ''')
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]

In [68]:
df[['lastName','firstName','productName']].drop_duplicates()

      lastName firstName                                  productName
0     Jennings    Leslie                               1958 Setra Bus
1     Jennings    Leslie                       1940 Ford Pickup Truck
2     Jennings    Leslie                      1939 Cadillac Limousine
3     Jennings    Leslie  1996 Peterbilt 379 Stake Bed with Outrigger
4     Jennings    Leslie                            1968 Ford Mustang
5     Jennings    Leslie                           1968 Dodge Charger
6     Jennings    Leslie                      1970 Plymouth Hemi Cuda
7     Jennings    Leslie                           1969 Dodge Charger
8     Jennings    Leslie                  1948 Porsche 356-A Roadster
9     Jennings    Leslie                         1969 Dodge Super Bee
10    Jennings    Leslie                        1976 Ford Gran Torino
11    Jennings    Leslie                             1957 Vespa GS150
12    Jennings    Leslie                    1957 Corvette Convertible
13    Jennings    Leslie                      1982 Ducati 900 Monster
14    Jennings    Leslie                      1982 Lamborghini Diablo
15    Jennings    Leslie                    1971 Alpine Renault 1600s
16    Jennings    Leslie                      1956 Porsche 356A Coupe
17    Jennings    Leslie                        1961 Chevrolet Impala
18    Jennings    Leslie                            1982 Ducati 996 R
19    Jennings    Leslie                    1974 Ducati 350 Mk3 Desmo
20    Jennings    Leslie                           2002 Yamaha YZR M1
21    Jennings    Leslie                            2001 Ferrari Enzo
22    Jennings    Leslie                           1969 Corvair Monza
23    Jennings    Leslie                             1969 Ford Falcon
24    Jennings    Leslie                            1903 Ford Model A
25    Jennings    Leslie                     Collectable Wooden Train
26    Jennings    Leslie                        1970 Triumph Spitfire
27    Jennings    Leslie                          1904 Buick Runabout
28    Jennings    Leslie                        18th century schooner
29    Jennings    Leslie             1912 Ford Model T Delivery Wagon
...        ...       ...                                          ...
2953    Gerard    Martin     1936 Mercedes-Benz 500K Special Roadster
2954    Gerard    Martin                        1926 Ford Fire Engine
2955    Gerard    Martin                  1913 Ford Model T Speedster
2956    Gerard    Martin                           1934 Ford V8 Coupe
2957    Gerard    Martin          18th Century Vintage Horse Carriage
2958    Gerard    Martin                     1917 Maxwell Touring Car
2959    Gerard    Martin                             1940s Ford truck
2960    Gerard    Martin                      1939 Cadillac Limousine
2961    Gerard    Martin                     1962 Volkswagen Microbus
2962    Gerard    Martin                        1936 Chrysler Airflow
2963    Gerard    Martin                  1980’s GM Manhattan Express
2964    Gerard    Martin  1996 Peterbilt 379 Stake Bed with Outrigger
2965    Gerard    Martin                              1982 Camaro Z28
2966    Gerard    Martin                     1917 Grand Touring Sedan
2967    Gerard    Martin                           1911 Ford Town Car
2968    Gerard    Martin                    1932 Model A Ford J-Coupe
2969    Gerard    Martin                       1928 Mercedes-Benz SSK
2970    Gerard    Martin                  1939 Chevrolet Deluxe Coupe
2971    Gerard    Martin    1938 Cadillac V-16 Presidential Limousine
2972    Gerard    Martin             1936 Mercedes Benz 500k Roadster
2974    Gerard    Martin                           1969 Corvair Monza
2981    Gerard    Martin                            1957 Chevy Pickup
2982    Gerard    Martin               1998 Chrysler Plymouth Prowler
2983    Gerard    Martin                       1964 Mercedes Tour Bus
2986    Gerard    Martin                           1970 Dodge Coronet
2988    Gerard    Martin          1958 Chevy Corvette Limited Edition
2989    Gerard    Martin            1992 Porsche Cayenne Turbo Silver
2991    Gerard    Martin                  1954 Greyhound Scenicruiser
2992    Gerard    Martin       1950's Chicago Surface Lines Streetcar
2993    Gerard    Martin             Diamond T620 Semi-Skirted Tanker

[1368 rows x 3 columns]

## Level Up: Display the Number of Products each Employee Has sold

In [95]:
#Your code here
df2 = df[['lastName','firstName','productName']]

In [96]:
df2 = df2.groupby(['lastName','firstName']).count()
df2.rename({'productName'})

AttributeError: 'DataFrameGroupBy' object has no attribute 'value_counts'

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!